{
  "authors": {
    "rickDouglas": {
      "name": "Rick Douglas",
      "role": "Movie Reviewer",
      "slug": "#",
      "imageUrl": "https://images.unsplash.com/photo-1519244703995-f4e0f30006d5?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=facearea&facepad=2&w=256&h=256&q=80"
    }
  },
  "posts": [
    {
      "id": 3,
      "title": "Twist and Shout",
      "movie": "Twisters",
      "slug": "#",
      "body": "I remember as a child being traumatized by the tornado in “The Wizard of Oz.” Even today, the scene of Dorothy running for cover under threatening skies, rendered in an other-worldly sepia, gives me chills.\nRecently, I read that the special effects director for “Oz,” Arnold Gillespie, created the cinematic monster by suspending muslin cloth from a steel gantry. Because, of course, in 1938 practical effects were all that moviemakers had to work with.\nFast forward nearly a hundred years and computers can do in a day what it took the movie pioneers back then weeks to accomplish.\nAnd in “Twisters,” the eagerly anticipated sequel to the 1996 original “Twister,” state-of-the-art effects put you at ground level of not one, but six monstrously destructive tornadoes. \nThe story begins with the movie’s heroine, Kate Cooper, played by Daisy Edgar-Jones (“I Know Why the Crawdads Sing”) as a grad student testing a wild theory about how you might engineer the collapse of a tornado. She and her plucky crew of fellow students, including her boyfriend, ride into the maw of a huge twister. \nThe field test doesn’t go as planned and Kate spends a good deal of the movie in a funk, trying without much success to atone for her mistakes. \nYears later, she’s approached by a surviving member of her team played by Anthony Ramos to join him in testing a radar-based 3-D mapping of a tornado, aided by a supercomputer. (By the way, the three mapping devices are, not coincidentally, named Scarecrow, Tin Man and Lion. It’s because in the original “Twister,” the computer used by storm chasers Helen Hunt and Bill Paxton was named Dorothy.)  And Kate’s original team similarly named theirs Dorothy.\nSo, Kate, who by now is working as a NOAA meteorologist in New York, puts aside her misgivings and reluctantly accompanies Ramos in his quest.\nIt means a trip back to her native Oklahoma, which in this story is made to seem like the country’s tornado capital. And it’s there she runs into a social media star played by Glen Powell, who bills himself as the “Tornado Wrangler.” Powell plays Tyler Owens with a cowboy swagger and a thousand-watt smile that’s become the actor’s stock in trade (See “Top Gun: Maverick”). \nThough Kate’s a nerdy scientist, Owens, whose macho smolder makes him a fictional YouTube star, is nonetheless smitten from the start. Which means their initial disparaging banter slowly grows into a mutual sort of admiration. It helps that they are often thrown into life-or-death situations where personal differences take a back seat to survival.\nThe dramatic scenes grow in intensity as do the twisters. And while sensible people might well drive away from spinning monsters that act like huge vacuums, these storm chasers drive right into them, braving heavy rain and baseball-size hail in the process.\nThe climax of the movie is a jaw-dropping sequence that involves a tornado ravaging a small town where the storm shelters are all full and the remaining townspeople take refuge in a movie theater. There’s no basement to escape to and everyone cowers in the seats as the tornadic winds rain bricks and plaster on those below.\n“Twisters” isn’t interested in back stories. So, you won’t find much to explain why these storm chasers do what they do; perhaps it’s risking their lives for war stories to tell at whatever local bar they spill into after a harrowing day on the road.  But frankly, in a movie that’s very nearly non-stop action, and a terrifying action at that, who really needs reasons and resumes?\nAs summer movies go, this one fills the bill. You’ll walk out of the theater feeling, as I did, like a pinball that took a beating but couldn’t quite find a safe place to land.",
      "imageUrl": "https://images.unsplash.com/photo-1496128858413-b36217c2ce36?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=3603&q=80",
      "date": "July 30, 2024",
      "datetime": "2024-07-30",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://images.unsplash.com/photo-1519244703995-f4e0f30006d5?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=facearea&facepad=2&w=256&h=256&q=80"
      }
    },
    {
      "id": 2,
      "title": "REBELS WITH A CAUSE",
      "movie": "Deadpool & Wolverine",
      "slug": "#",
      "body": "As I watched this latest entry in the Marvel Cinematic Universe (MCU,) I imagined the five screenwriters meeting over beers and pizza and tossing out to each other every ridiculous idea that an alcoholic fog might induce.\n\nBecause the narrative is a jumble of jokes, self-reverential posturing, pornographic humor, R-rated dialogue (beware parents!), F-bombs, as well as digs at the parent company Disney and lamentations over the demise of 20th Century Fox, which originated the “Deadpool” franchise and got swallowed by the Mouse House a few years ago.\n\nLet’s be honest here: there’s not much of a story.\n\nIt has a lot to do with a villain named Mr. Paradox, who summons Deadpool to his headquarters, where he’s in charge of multiverse maintenance. And already we’re in the territory rightly claimed by Meta-loving MCU fanboys. Matthew Macfadyen, of “Succession” fame, is a riot as an officious functionary with a haughty air that aims to cut Deadpool down to size.\n\nHe gives Deadpool a choice but the reality is that no matter which of the two scenarios he chooses, Deadpool’s a dead man. Except that anyone familiar with the franchise knows Deadpool can never die.\n\nAnd that is my one beef with the movie. Ryan Reynolds’ Deadpool is indestructible. As is Hugh Jackman’s Wolverine. And that matters in a superhero movie in which there has to be a plausible plot device where the hero is, to some degree, vulnerable. After all, Superman has his Kryptonite.\n\nBefore the story is even minutes old, Deadpool faces off against an army of tech-savvy soldiers and every single one of the helmeted villains meets with a grisly fate. Buckets of blood are spilled, beheadings and stabbings unfold with deadly precision and Deadpool merely brushes himself off like he’s just attended a chaotic garden party. He more than lives up to his self-described moniker Marvel Jesus.\n\nAs an introduction to the mayhem to come, the scene is, frankly, jokey fun. But the carnage never really lets up.\n\nThis movie is a non-stop gore fest, interrupted occasionally with exposition that attempts to make sense of a thin entry in the Deadpool franchise.\n\nThere is fun in identifying a roster of actors who have brief cameos. And one in particular (I won’t mention who) made me wistful for the early days of Marvel movies. Back then, the multiverse hadn’t been fully explored and the stories were strong enough to stand on their own.\n\nNow it seems storylines have to be the product of a feedback loop where even the villains look to be recycled. Emma Corrin, who portrayed a young and vulnerable Princess Diana in the BBC production “The Crown,” is slumming here as a bald and pale imitation of Tilda Swinton. Although she tosses off a tidbit where she claims she was visited by a traveling magician and tells the heroes “Of course I had to kill him.” Fans of the multiverse immediately know she’s referring to Dr. Strange. And then she produces a fiery teleportal that would make Strange proud.\n\nIt's hard to take any of this seriously. But in the end Reynolds offers a welcome vulnerability that, though it doesn’t redeem a convoluted and quite violent movie (the first MCU entry boasting an R rating), it still manages to tug at the heartstrings.",
      "imageUrl": "https://images.unsplash.com/photo-1496128858413-b36217c2ce36?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=3603&q=80",
      "date": "July 24, 2024",
      "datetime": "2024-07-24",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://images.unsplash.com/photo-1519244703995-f4e0f30006d5?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=facearea&facepad=2&w=256&h=256&q=80"
      }
    },
    {
      "id": 1,
      "title": "The Life of Riley",
      "movie": "Inside Out 2",
      "slug": "#",
      "body": "The hero of the story is the same Riley featured in the original “Inside Out,” only now she’s a 13-year-old high school student burdened with all the fears and anxiety that accompany growing into the teen years.\n\nMore than anything, Riley wants to be accepted by the cooler girls on the school’s hockey team.\n\nAnd her struggle to fit in is the framework of this sequel.\n\nOf course, as in the original, we spend most of the movie inside her head populated by the human-like emotions of Joy, Sadness, Fear, Disgust and Anger. They’re voiced by Amy Poehler, Phyllis Smith, Tony Hale, Liza Lapira and a volcanic Lewis Black.\n\nThese emotions (emoticons?) navigate Riley’s inner self by way of a glowing console that, by now, is flashing a “Puberty Alarm.”\n\nAnd this being a growing-up tale, a new cast of emotions has joined the fray: Anxiety, Envy, Ennui and Embarrassment.\n\nThe addition of the Ennui character, for me, is a head-scratcher. Since ennui is a rather sophisticated state of mind, it’s far removed from the lives of the tykes this film is aimed at and I am curious if it’s not a little joke inserted by the Pixar animators to appeal to parents.\n\nIn any event, the story builds as Riley’s hockey prowess is put to the test. At first, she simply tries to keep up, but with growing ambition, she wrestles with the anxiety that goes along with it.\n\nAnd that has her clutch of emotions on a do-or-die mission to keep her grounded and focused.\n\nThe animation is a neon marvel, like a box of Skittles given wings. And even though some story details might be a bit too mature for the kiddoes, there’s still enough mayhem on screen to keep them captivated.\n\n“Inside Out 2” is Pixar at its best and most inventive. And, yup, the finale might just have you shedding a few tears.\n\nBut it has me wondering. Will there be a third movie in the series? I can suggest a villain: Acne!",
      "imageUrl": "https://images.unsplash.com/photo-1496128858413-b36217c2ce36?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=3603&q=80",
      "date": "Jul 12, 2024",
      "datetime": "2024-07-12",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://images.unsplash.com/photo-1519244703995-f4e0f30006d5?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=facearea&facepad=2&w=256&h=256&q=80"
      }
    }
  ]
}