{
  "authors": {
    "rickDouglas": {
      "name": "Rick Douglas",
      "role": "Movie Reviewer",
      "slug": "#",
      "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
    }
  },
  "posts": [
    {
      "id": 5,
      "title": "Twist and Shout",
      "movie": "Twisters",
      "slug": "/fort-kent-cinema-blog/review-of-the-movie-twisters/",
      "body": "I remember as a child being traumatized by the tornado in “The Wizard of Oz.” Even today, the scene of Dorothy running for cover under threatening skies, rendered in an other-worldly sepia, gives me chills.\nRecently, I read that the special effects director for “Oz,” Arnold Gillespie, created the cinematic monster by suspending muslin cloth from a steel gantry. Because, of course, in 1938 practical effects were all that moviemakers had to work with.\nFast forward nearly a hundred years and computers can do in a day what it took the movie pioneers back then weeks to accomplish.\nAnd in “Twisters,” the eagerly anticipated sequel to the 1996 original “Twister,” state-of-the-art effects put you at ground level of not one, but six monstrously destructive tornadoes. \nThe story begins with the movie’s heroine, Kate Cooper, played by Daisy Edgar-Jones (“I Know Why the Crawdads Sing”) as a grad student testing a wild theory about how you might engineer the collapse of a tornado. She and her plucky crew of fellow students, including her boyfriend, ride into the maw of a huge twister. \nThe field test doesn’t go as planned and Kate spends a good deal of the movie in a funk, trying without much success to atone for her mistakes. \nYears later, she’s approached by a surviving member of her team played by Anthony Ramos to join him in testing a radar-based 3-D mapping of a tornado, aided by a supercomputer. (By the way, the three mapping devices are, not coincidentally, named Scarecrow, Tin Man and Lion. It’s because in the original “Twister,” the computer used by storm chasers Helen Hunt and Bill Paxton was named Dorothy.)  And Kate’s original team similarly named theirs Dorothy.\nSo, Kate, who by now is working as a NOAA meteorologist in New York, puts aside her misgivings and reluctantly accompanies Ramos in his quest.\nIt means a trip back to her native Oklahoma, which in this story is made to seem like the country’s tornado capital. And it’s there she runs into a social media star played by Glen Powell, who bills himself as the “Tornado Wrangler.” Powell plays Tyler Owens with a cowboy swagger and a thousand-watt smile that’s become the actor’s stock in trade (See “Top Gun: Maverick”). \nThough Kate’s a nerdy scientist, Owens, whose macho smolder makes him a fictional YouTube star, is nonetheless smitten from the start. Which means their initial disparaging banter slowly grows into a mutual sort of admiration. It helps that they are often thrown into life-or-death situations where personal differences take a back seat to survival.\nThe dramatic scenes grow in intensity as do the twisters. And while sensible people might well drive away from spinning monsters that act like huge vacuums, these storm chasers drive right into them, braving heavy rain and baseball-size hail in the process.\nThe climax of the movie is a jaw-dropping sequence that involves a tornado ravaging a small town where the storm shelters are all full and the remaining townspeople take refuge in a movie theater. There’s no basement to escape to and everyone cowers in the seats as the tornadic winds rain bricks and plaster on those below.\n“Twisters” isn’t interested in back stories. So, you won’t find much to explain why these storm chasers do what they do; perhaps it’s risking their lives for war stories to tell at whatever local bar they spill into after a harrowing day on the road.  But frankly, in a movie that’s very nearly non-stop action, and a terrifying action at that, who really needs reasons and resumes?\nAs summer movies go, this one fills the bill. You’ll walk out of the theater feeling, as I did, like a pinball that took a beating but couldn’t quite find a safe place to land.",
      "imageUrl": "http://cdn.fortkentcinema.com/review-photos/TWISTERS+IMAGE+2.JPG",
      "date": "July 30, 2024",
      "datetime": "2024-07-30",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 4,
      "title": "REBELS WITH A CAUSE",
      "movie": "Deadpool & Wolverine",
      "slug": "/fort-kent-cinema-blog/review-of-the-movie-deadpool-and-wolverine/",
      "body": "As I watched this latest entry in the Marvel Cinematic Universe (MCU,) I imagined the five screenwriters meeting over beers and pizza and tossing out to each other every ridiculous idea that an alcoholic fog might induce.\nBecause the narrative is a jumble of jokes, self-reverential posturing, pornographic humor, R-rated dialogue (beware parents!), F-bombs, as well as digs at the parent company Disney and lamentations over the demise of 20th Century Fox, which originated the “Deadpool” franchise and got swallowed by the Mouse House a few years ago.\nLet’s be honest here: there’s not much of a story.\nIt has a lot to do with a villain named Mr. Paradox, who summons Deadpool to his headquarters, where he’s in charge of multiverse maintenance. And already we’re in the territory rightly claimed by Meta-loving MCU fanboys. Matthew Macfadyen, of “Succession” fame, is a riot as an officious functionary with a haughty air that aims to cut Deadpool down to size.\nHe gives Deadpool a choice but the reality is that no matter which of the two scenarios he chooses, Deadpool’s a dead man. Except that anyone familiar with the franchise knows Deadpool can never die.\nAnd that is my one beef with the movie. Ryan Reynolds’ Deadpool is indestructible. As is Hugh Jackman’s Wolverine. And that matters in a superhero movie in which there has to be a plausible plot device where the hero is, to some degree, vulnerable. After all, Superman has his Kryptonite.\nBefore the story is even minutes old, Deadpool faces off against an army of tech-savvy soldiers and every single one of the helmeted villains meets with a grisly fate. Buckets of blood are spilled, beheadings and stabbings unfold with deadly precision and Deadpool merely brushes himself off like he’s just attended a chaotic garden party. He more than lives up to his self-described moniker Marvel Jesus.\nAs an introduction to the mayhem to come, the scene is, frankly, jokey fun. But the carnage never really lets up.\nThis movie is a non-stop gore fest, interrupted occasionally with exposition that attempts to make sense of a thin entry in the Deadpool franchise.\nThere is fun in identifying a roster of actors who have brief cameos. And one in particular (I won’t mention who) made me wistful for the early days of Marvel movies. Back then, the multiverse hadn’t been fully explored and the stories were strong enough to stand on their own.\nNow it seems storylines have to be the product of a feedback loop where even the villains look to be recycled. Emma Corrin, who portrayed a young and vulnerable Princess Diana in the BBC production “The Crown,” is slumming here as a bald and pale imitation of Tilda Swinton. Although she tosses off a tidbit where she claims she was visited by a traveling magician and tells the heroes “Of course I had to kill him.” Fans of the multiverse immediately know she’s referring to Dr. Strange. And then she produces a fiery teleportal that would make Strange proud.\nIt's hard to take any of this seriously. But in the end Reynolds offers a welcome vulnerability that, though it doesn’t redeem a convoluted and quite violent movie (the first MCU entry boasting an R rating), it still manages to tug at the heartstrings.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/DEADPOOL+AND+WOLVERINE+IMAGE.JPG",
      "date": "July 24, 2024",
      "datetime": "2024-07-24",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 3,
      "title": "The Life of Riley",
      "movie": "Inside Out 2",
      "slug": "/fort-kent-cinema-blog/review-of-the-movie-inside-out-two/",
      "body": "The hero of the story is the same Riley featured in the original “Inside Out,” only now she’s a 13-year-old high school student burdened with all the fears and anxiety that accompany growing into the teen years.\nMore than anything, Riley wants to be accepted by the cooler girls on the school’s hockey team.\nAnd her struggle to fit in is the framework of this sequel.\nOf course, as in the original, we spend most of the movie inside her head populated by the human-like emotions of Joy, Sadness, Fear, Disgust and Anger. They’re voiced by Amy Poehler, Phyllis Smith, Tony Hale, Liza Lapira and a volcanic Lewis Black.\nThese emotions (emoticons?) navigate Riley’s inner self by way of a glowing console that, by now, is flashing a “Puberty Alarm.”\nAnd this being a growing-up tale, a new cast of emotions has joined the fray: Anxiety, Envy, Ennui and Embarrassment.\nThe addition of the Ennui character, for me, is a head-scratcher. Since ennui is a rather sophisticated state of mind, it’s far removed from the lives of the tykes this film is aimed at and I am curious if it’s not a little joke inserted by the Pixar animators to appeal to parents.\nIn any event, the story builds as Riley’s hockey prowess is put to the test. At first, she simply tries to keep up, but with growing ambition, she wrestles with the anxiety that goes along with it.\nAnd that has her clutch of emotions on a do-or-die mission to keep her grounded and focused.\nThe animation is a neon marvel, like a box of Skittles given wings. And even though some story details might be a bit too mature for the kiddoes, there’s still enough mayhem on screen to keep them captivated.\n“Inside Out 2” is Pixar at its best and most inventive. And, yup, the finale might just have you shedding a few tears.\nBut it has me wondering. Will there be a third movie in the series? I can suggest a villain: Acne!",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/INSIDE+OUT+2+IMAGE.JPG",
      "date": "Jul 12, 2024",
      "datetime": "2024-07-12",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 2,
      "title": "Pizza and the Apocalypse",
      "movie": "A Quiet Place: Day One",
      "slug": "/fort-kent-cinema-blog/review-of-the-a-quiet-place-day-one/",
      "body": "For those of you who have yet to watch the first two films in the Quiet Place series, a short\nintroduction.\nBack in 2018, actor John Krasinski (“The Office”) wowed Hollywood with a high-concept horror\nfilm that he wrote, directed and starred in, along with his real-life wife Emily Blunt.\nThe film exceeded expectations and shot Krasinski near to the top of young directors.\nThe story introduced a race of aliens with super-sensitive hearing; the movie’s tagline was “If\nThey Hear You, They Will Hunt You.”\nThe no-name aliens are as malevolent as they come, with spider-like arms and legs that allow\nthem to scurry at a break-neck speed and with an array of teeth that can rip a body to shreds in\nmere minutes.\nSo as the first film opens, Krasinski’s family of five is gingerly walking through woods to an\nabandoned store in search of provisions. Their every step, unless carefully placed, could be an\ninvitation to a quick and terrifying demise.\nTheir predicament suggested a nod to the TV enterprise “The Walking Dead,” because the\nzombies in that series were attracted to loud noises. But in Krasinski’s world, the danger is more\nfinely tuned. Your downfall might be a muffled cough, a snapped twig or a sneeze.\nThe lessons learned in the first film were that the aliens’ acute hearing could be their downfall,\nand that they cannot swim.\nA sequel delved even more deeply into the aliens’ behavior and it, too, was a huge success.\nOn its heels, we now have “Day One,” an origin story that takes place in Manhattan.\nIt stars Lupita Nyong’o and an actor I don’t know well named Joseph Quinn.\nAnd given the familiarity many moviegoers already have with the chittering alien monsters, they\nare merely a framework that allows Nyong’o and Quinn to shine brightly at the story’s center.\nThey are two strangers thrown together in the midst of an apocalypse, along with an adorable\ncat that helps Nyong’o stay grounded while she deals with a cancer growing inside her and kept\nat bay with medicated patches.\nThe horror of the alien invasion unfolds swiftly and it’s clear the federal response is to turn\nManhattan into an island even more isolated than before, by destroying all the bridges that\nconnect to the rest of New York and New Jersey.\nThe only safe way out is to head for the South Street Seaport and get on boats evacuating the\nfew who survived the initial wave of the alien creatures. Again, we’re reminded they can’t swim.\nBut Nyong’o tells her new friend she is heading in the opposite direction—to Harlem—and\npizza.\nIt’s a strange quest in the face of all but certain death but she is determined. It’s great pizza, she\ninsists.\nI will say no more about Harlem or the pizza, but the obstacles the pair face are daunting and\ntheir trek through damaged buildings and deserted streets is handled with an authenticity that\nheightens the tension.\nThis New York City, which on a good day has a decibel level that rivals screaming, is now very\nmuch a quiet place that must not be disturbed. The hunters are everywhere.\nThe plight of Nyong’o and Quinn reminded me of the song “Boulevard of Broken Dreams,”\nbecause both have inner demons that rival what lurks in the shadows, in a city that itself is\nbowed and broken.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/A+QUIET+PLACE+DAY+ONE+IMAGE.JPG",
      "date": "June 30, 2024",
      "datetime": "2024-08-30",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 1,
      "title": "A PANDORA’S BOX",
      "movie": "Avatar: The Way of The Water",
      "slug": "/fort-kent-cinema-blog/review-of-the-movie-avatar/",
      "body": "That the sequel to the original Avatar would be a mind-blowing visual experience was always a given and that it would be a very long movie was also a given. Director James Cameron has never been known for economy or brevity. You wonder what a conversation with him over dinner would be like. It might run to breakfast.\n“Avatar: The Way of Water” is a three-hour testament to the magic that computer-generated imagery can add to the theater-going experience. Even better, the CGI this time around reflects the advances that have been made in the 13 years since the original.\nUnfortunately, I likely won’t be able to witness just how jaw-dropping this film is in 3-D. Like many moviegoers who don’t reside in big cities with access to 3-D technology or, for that matter, IMAX, I had to settle for 2-D. But it was memorable anyway, offering a truly immersive experience.\nOnce again, we are exploring the dream world of the planet Pandora and encountering the blue-skinned, ten-feet-tall Na’vi. With the planet Earth dying from humanity’s extravagant environmental indifference, earthlings, dubbed “The Sky People,” have set their sights on Pandora for colonization and plundering yet another resource-rich environment.\nAnd this time the Holy Grail is a substance extracted from the brains of a species of whale that leads to immortality.\nThat’s the setting. But the heart of the story is a search-and-destroy mission of another kind. Colonel Miles Quaritch, though dead at the end of the first movie, has been resuscitated as a living Na’vi warrior. He and his similarly recombinant henchmen are hell-bent on finding and killing the hero Jake Sully (played by Sam Worthington).\nJake and his Na’vi wife Neytiri (Zoe Saldana) are made aware of this latest threat and, with their three children, race to seek refuge on another part of Pandora, with a distinctly different tribe who populate a series of islands.\nThese “Water People,” the Metkayina, have evolved to the extent that they can breathe for long stretches underwater. The sudden arrival of the Sully family is met with disdain and a realization that these refugees might bring trouble in their wake.\nThe teal-colored beings have elaborate tattoos, much like the Na’vi, and there has been a fresh spate of criticism from those who see their usage by Cameron as cultural appropriation—unwelcome at a time when we’re all supposed to be sympathetic to the plight of indigenous peoples everywhere.\nFrom an art direction perspective, however, the tattoos, suggestive of the Maori culture of New Zealand, where much of the movie was shot, certainly add to the exotic nature of these alien creatures, so I will leave the appropriation arguments to those with more at stake.\nAnother criticism being leveled at Way of Water is how much the story echoes what we saw in the first movie. I thought about that while watching it and decided Cameron had no choice, since he was telling a story that first unspooled 13 years ago, and that moviegoers, young and old alike, might not have seen or even remember.\nBut this time around, the Avatar focus is more on the teenagers from the two tribes, a departure from the original. You could make the argument that Avatar 2 is really a YA (“Young Adult”) story, laden with teen angst. About the only thing missing is acne.\nSo, in sum, this newest Avatar is best appreciated as a giant leap in movie-making and less as a totally new adventure. Cameron, with fingers crossed, promises that will happen in the third installment he’s already shot called “Avatar 3: The Seed Bearer,” scheduled for release in 2024.\nSure, it might be a fool’s errand for the Disney folks to hope that Avatar 2 measures up to the success of the first. After all, that one was released before streaming even existed, and still ranks as the box office champ of all time.\nBut you would be hard-pressed to name any movie in the past few years that offers as much heart-stopping spectacle and that rewards moviegoers with a thrill ride that doesn’t end until the credits roll.\nJust remember to double down on the popcorn.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/AVATAR+OCEAN+PEOPLE.JPG",
      "date": "December 23, 2022",
      "datetime": "2022-12-22",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 1,
      "title": "Guard Your Chestnuts",
      "movie": "Violent Night",
      "slug": "/fort-kent-cinema-blog/review-of-violent-night/",
      "body": "When it comes to Christmas movies, let’s be honest. The classics are few and far between. And with The\nHallmark Channel churning out cookie-cutter, holiday-themed movies by the dozens every year, you can\nquickly overdose on Yuletide mirth.\nBut then along comes “Violent Night,” which more than lives up to its title, if not R rating. In a nutshell,\nthe action-comedy mixes elements of “Bad Santa,” “Die Hard (yes, Die Hard),” “Home Alone” and a\nlittle-seen but worthy entry called “The Ref.” That’s a black comedy from 1994, starring Denis Leary and\nJudy Davis. Leary plays a thief who holds a family hostage.\nWell, “Violent Night” is the story of some very bad dudes who hold a wealthy family hostage in order to\nsteal their modest $300 million fortune stashed in an underground vault. As you do when you have a\nfortune to stash.\nSanta Claus, the real Santa Claus, played by David Harbour (“Stranger Things,” “Black Widow”) happens\nto stop at the home of the Lightstone family on Christmas Eve and finds himself torn between his annual\ntoys-down-the-chimney ritual and saving young Trudy and her family from some truly violent\npsychopaths who mow down the servants before rounding up the relatives for some harsh\ninterrogations.\nNo surprise that the night visitors are all on the Naughty List.\nSanta can’t bear the thought of leaving the Lightstones helpless in the face of all-but-certain death.\nBesides, director Tommy Wirkola gives Santa a unique back story. Turns out he was himself a baddie,\nabout 1400 or so years ago. “I was mean,” he says. And he wielded a hammer that left no skull\nuncrushed.\nEventually he changed his ways, thanks I suppose to the love and support of Mrs. Claus.\nBut he now finds himself having to dig deep into that darker corner of his soul. And watching him stalk\nand dispatch the intruders, who by the way have cute nicknames like Gingerbread and Krampus,\nreminded me of Bruce Willis in “Die Hard,” picking off the terrorists in the Nakatomi tower like decoys in\na shooting gallery.\nHarbour’s Santa is a world-weary slob with bloodshot eyes and some impressive tattoos. He is not the\njolly archetype made famous in all those vintage Coke ads. Put another way, in his North Pole patois, the\nF-word ain’t fudge. Especially when he steps in some of Blitzen’s poo.\nAnd yet he’s the perfect foil for John Leguizamo who plays Jimmy Scrooge, the sneering leader of the\nmurderous mercenaries; he’s not a suave international evildoer like Hans Gruber of “Die Hard.” Jimmy’s\nmore into bullets than bon mots. He’s a guy who grew up hating the holidays because of some\nchildhood trauma that turned his heart as black as a lump of coal. And at one point, he comes close to\nrealizing his ultimate dream: killing Christmas. But you just know that in the end he’s no match for the\nreal Mr. Claus.\n“Violent Night” goes down like spiked eggnog. It’s Christmas cheer with a little extra kick, and most\noften to the sugar plums.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/VIOLENT+NIGHT.JPG",
      "date": "December 2, 2022",
      "datetime": "2022-12-2",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 1,
      "title": "Last Supper",
      "movie": "The Menu",
      "slug": "/fort-kent-cinema-blog/review-of-the-menu/",
      "body": " A  few years ago I was in Lima, Peru, on a Sunday afternoon.\nAs I walked to my hotel, I passed a gate with a small brass plaque announcing the entrance to Maido, one of the “World’s 50 Best Restaurants,” as chosen by San Pellegrino and partners.\nThe sign said Maido closed at 4, and it was getting toward 3, so I asked the burly gatekeeper if I would be allowed to dine there, so close to closing time.\nHe called upstairs and then ushered me inside.\nMaido is the brainchild of Japanese chef Mitsuharu Tsumura, who has fused Japanese and Peruvian flavors to great acclaim.\nThe service was a bit rushed, given the late hour, but I enjoyed every bite, from the guinea pig appetizer to the rich chocolatey dessert. And, best of all, I found it reasonably priced.\nI thought about that memorable meal as I watched “The Menu,” the new thriller from Searchlight Pictures.\nThe story takes place in a restaurant called “Hawthorn,” named for its island location, ostensibly off  Washington State, although the scenery more closely resembled coastal Georgia.\nHawthorn is run by acclaimed chef Julian Slowik (Ralph Fiennes), who charges his clientele an eye-watering $1250 per person for the privilege of dining in his exclusive establishment.\nThe diners are high-rollers, the kind of foodies who seek out such places more for the bragging rights than savoring the slavishly-prepared food.\nAmong them, some young Wall Street wizards who worship money above all else; a failed movie actor looking for redemption; and an imperious food critic who proudly announces that she was the first to put Julian “on the map” early in his career.\nTheir visit begins with a tour of the property, including the barracks style living quarters for the staff. The spartan conditions, including rows of simple cots, seem oddly out of place in such a luxurious retreat.\n“You live here?” asks a curious diner.\nSlowik’s major domo, an officious Asian woman, tells the group they are devoted to their kitchen idol, but in a way that registers both inscrutable and maybe a bit malevolent.\nThen everyone is seated and the experience unfolds. The film is presented as a menu, with each offering announced with a title card. But not before Slowik claps his hands sharply and his chef’s assistants yell in unison “Yes, Chef!”\nThe pageantry at first comes off as unnecessarily pretentious, but then unnerving, as the tension builds with each clap and you begin to wonder why Slowik brought together this particular group on this particular night. And is there more to the menu than meets the eye?\nUnfortunately for the assembled group, the answer is yes.\nIn one early scene, Slowik admonishes a young woman (Anya Taylor-Joy), a last-minute substitute date for a character played by Nicholas Hoult, that “You shouldn’t be here tonight.”\nThe line cuts like a Ginzu knife.\nSo, welcome to Hawthorn, where the sinister floor show includes more than the amuse bouche and entrees made from seaweed and air.\nMaido this is not.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/THE+MENU+IMAGE.JPG",
      "date": "December 2, 2022",
      "datetime": "2022-12-2",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 1,
      "title": "COASTING ON CHARISMA",
      "movie": "Ticket to Paradise",
      "slug": "/fort-kent-cinema-blog/review-of-ticket-to-paradise/",
      "body": "The trailers have been running in theaters for months: Julia Roberts and George Clooney bickering and scheming to keep their law school-bound daughter from making what they consider the mistake of her life. Lily, after just a few days in Bali, has fallen for a sexy seaweed farmer.\nThere’re all kinds of problems with that scenario. To begin with, Lily seems too driven and book-smart to throw her lifelong plans away after a few mai-tais, even though her prospective beau Gede has charm to spare and lives in what passes for paradise on earth (Australia sitting in for Bali).\nThankfully, Gede’s parents aren’t portrayed as native simpletons, but as kind, generous and loving people who trust their son to make his own way in life. That’s in stark contrast with Lily’s parents, David and Georgia, who travel halfway around the world to sabotage the impending wedding.\nThat’s because their own marriage faltered years ago, so even now they are consumed by cynicism and alleged contempt for each other. Clooney and Roberts shine in early scenes where the barbs hit with a poisonous precision. But all concerned here know you don’t pair two A-listers and expect them to live unhappily ever after.\nAs they team up to drive a wedge between Gede and Lily, their plan unravels.\nAlong the way, Roberts’s Georgia, the owner of a Los Angeles art gallery, begins to question why she should continue a relationship with a much younger airline pilot (Lucas Bravo, “Emily in Paris”) whose puppyish enthusiasm can be grating at times. He arranges the cockpit duty to Bali so he can press Georgia to make a commitment she might not be ready for.\nAnd you can see from miles away where the story is headed. The two exes share the memories of what drew them together in the first place. And they realize trying to split up their daughter and her in-the-moment fiancé is too selfish even for people who have made selfishness a second career.\nRoberts and Clooney have history, having made two Ocean’s movies together early on. So, their dynamic  is believable and welcome and helps support an otherwise weak script.\nIf nothing else, the scenery is breath-taking and, more than once, I wanted to sink my toes in the white sand and drink whatever it is that gets the Balinese through their day.\n“Ticket to Paradise” is a fun little romp with a genuine sweetness that has been missing from theaters for far too long. But let’s hope Roberts and Clooney make another movie that has more on its mind than beer pong and dancing dolphins.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/TICKET+TO+PARADISE+BEST.JPG",
      "date": "November 3, 2022",
      "datetime": "2022-11-3",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 1,
      "title": "Speak of the Devil",
      "movie": "Prey for the Devil",
      "slug": "/fort-kent-cinema-blog/review-of-prey-for-the-devil/",
      "body": "Here I thought the latest variant of the Coronavirus was the scourge we all had to worry about most. But “Prey for the Devil” tells us at the outset that demonic possession is the epidemic that matters most.\nAnd the Catholic Church is ready, willing and able to help us out.\nThe story takes place at an exorcism school that’s ostensibly in Boston, although the end credits offer an impressive list of names that appear to be Russian in origin, or at least Bulgarian, so no one here pahks their cah in Hahvid Yahd. Try Sofia.\nIn the basement of said school are high-tech isolation cells, the treatment rooms for those suffering from demonic possession. And only young priests, like wizards-in-training at Hogwarts, are allowed to act when the school’s medical team fails in its mission; it’s off-limits to nuns.\nAt the heart of the story is a young nun, Sister Ann, played by Jacqueline Byers, who seems bent on breaking the rules and who develops a strange fixation on a ten-year-old girl, Natalie, who shows the first signs of a deal with the devil. She doesn’t vomit pea soup a la Linda Blair in “The Exorcist,” but she holds her own in the sudden scare department.\nNatalie can crawl up walls and twist herself into a human pretzel at will. And she takes to Sister Ann immediately, foreshadowing a showdown that’s not hard to figure out ahead of time.\nAnn singlehandedly challenges the school’s administrators and, by extension, the Catholic Church in her seemingly impossible quest to rid her young charge of Beelzebub himself. She’s a superhero in a habit.\nThere’s a lot of exposition about Catholic guilt that went right over my head, since I didn’t grow up in the Catholic tradition. But we learn along the way the hardest cases of possession are transferred to Rome where the Vatican is the court of last resort.\nFor reasons I won’t divulge here, Ann refuses to allow that to happen to Natalie, despite the misgivings of everyone around her. And that’s even after the possessed Natalie kills a priest and two medics during an ambulance ride.\nAs an aside, this was one of the final two films to feature British actor Ben Cross, best known to American audiences as the hero of “Chariots of Fire.” In “Prey,” he plays Cardinal Matthews of Boston with impressive gravitas. Cross died in 2020 at 72 before the film’s release.\n“Prey for the Devil” is rated PG-13, but it’s not appropriate for younger moviegoers. Mostly because the story is just too dense and dark for kids to follow.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/PREY+FOR+THE+DEVIL.JPG",
      "date": "October 27, 2022",
      "datetime": "2022-10-27",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 1,
      "title": "MURDERS MOST FOUL",
      "movie": "See How They Run",
      "slug": "/fort-kent-cinema-blog/review-of-see-how-they-run/",
      "body": "Let me be blunt. If you know nothing about legendary British crime fiction author Agatha Christie, this movie might not be your cup of Earl Gray.\nBy way of explanation, Christie is regarded as perhaps the greatest mystery thinker-upper of the 20th century. In fact, her signature play, “The Mouse Trap,” has been seen by roughly 100-million people since it opened in London’s West End back in 1952. And, except for the pandemic year, it has been running continuously, making it the longest-running play in history.\n“See How They Run” opens in 1953, as the play and its cast are celebrating 100 fabulous performances.\nA veteran producer has chosen a director to make a movie of the play and that director is played to unctuous perfection by Adrien Brody. He’s a supreme egotist and manages in short order to offend just about everyone he encounters.\nIt’s a standard trope in Christie mysteries that the most unlikable character meets an untimely end right at the start. And then a sharp-witted detective moves in to discern the identity of the murderer. In Christie’s most famous works, such as “Murder on the Orient Express,” and “Death on the Nile,” the inquisitor is Belgian sleuth Hercule Poirot.\nBut here, the gumshoe is played by American character actor Sam Rockwell, his Inspector Stoppard being no stranger to booze or broad pronouncements. Though the actor’s hit-or-miss attempt at a British accent seems beside the point, his charm wafts through the air like aftershave.\nHis sidekick, Constable Stalker, is played winningly by Irish actress Saoirse Ronan (“Lady Bird”) and her Constable often outshines Rockwell’s Stoppard with a youthful determination to get to the heart of the mystery at hand.\nSo, Brody’s Leo Kopernick gets bumped off early and the game is afoot. Whodunnit? And why? Was it because he’s a drunken party-crasher? Doesn’t seem likely. And if he was hired to make a movie of the hit play, you can be darn sure the actors in said play aren’t going to dispatch the man who could bring them certain stardom.\nBut that still leaves quite a few prime suspects in his circle of acquaintances for finger-pointing.\nTo say more would be a crime in itself. But “See How They Run” is an admirable addition to the current spate of smart mysteries like “Only Murders in the Building” or “Knives Out” and its upcoming sequel “The Glass Onion.”\nAnd maybe the best part of the movie, at least for me, is a third act appearance by the legendary Christie herself. Everyone is gathered at her country estate for a final showdown that I didn’t see coming. And all I can say in closing is, best not drink the tea.\n",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/SEE+HOW+THEY+RUN+IMAGE.JPG",
      "date": "October 27, 2022",
      "datetime": "2022-10-27",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 1,
      "title": "DON’T GET AROUND MUCH ANYMORE",
      "movie": "Three Thousand Years of Longing",
      "slug": "/fort-kent-cinema-blog/review-of-three-thousand-years-of-longing/",
      "body": "Pity the lot of a genie, or, more accurately, a Djinn.\nHe’s cursed to live, in spectral fashion, inside a bottle. And not the mid-century, pink-pillowed and plush, studio-apartment-like, room-without-a-view of Jeannie in the 60s sitcom “I Dream of Jeannie.\nThe djinn here, embodied by British actor Idris Elba, is but a wisp of smoke until he is released once again by an unsuspecting owner of said bottle.\nThis has been going on a very long time.\nAnd there are rules to this sort of thing, as there must be I suppose.\nYou can’t wish to reanimate someone who is no longer living. And you can’t simply wish for dozens more wishes. It’s three and you’re done.\nThis is all explained to Alithea Binnie, a divorced woman, played by Tilda Swinton, who wanders into the Grand Bazaar of Istanbul while in the city for a conference. Alithea is a scholar and her expertise happens to be a discipline called narratology, which I understand is the study of story-telling.\nWandering the stalls, she discovers a bottle which she buys and takes back to her hotel room. Of course, it needs a bit of polishing and, as she performs the task, colored smoke billows from its insides and then a huge djinn stands before her ready to grant three wishes, all the while minding those pesky rules of course.\nAlithea is too much of a pragmatist to believe in wishes and fairy tales, apart from what she studies. And initially she rebuffs the djinn, telling him she won’t be asking for anything as fanciful as wish-fulfillment.\nBut the djinn knows that without Althea buying into his plight, he might have to endure another thousand years of longing to be free of the business of wish-granting.\nSo, he tells her stories of previous owners who squandered their good fortune and these tales are some of the most dazzling ever put on screen.\nThat they come courtesy of the director of the Mad Max movies, George Miller, is a bit of a surprise. But Miller also gave us “Babe,” so he knows how to weave tales both intimate and incendiary.\nMiller’s use of red is in itself striking and I imagine that sometime in the future a film school student will focus on it as the basis of a master’s thesis. For now, though, it’s satisfying to let Miller’s extraordinary color palette just wash over you.\nThis wouldn’t be much of a story if Alithea doesn’t eventually indulge in a fantasy or two. But one of her wishes is altogether out of character for a prim, no-nonsense academic who can be as brittle as the bottle that got all this started. \nAnd yet I bought it all. Because it’s hard to resist two outstanding actors like Tilda Swinton and Idris Elba who effortlessly make us believe in a tale as old as time.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/THREE+THOUSAND+YEARS+OF+LONGING.JPG",
      "date": "September 19, 2022",
      "datetime": "2022-9-19",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 1,
      "title": "Double OMG",
      "movie": "No Time to Die",
      "slug": "/fort-kent-cinema-blog/review-of-no-time-to-die/",
      "body": "Quite a while ago, Eon Productions, the company behind the James Bond films, announced that there would be a series re-boot after the diminishing returns of the Pierce Brosnan era.\n\nTheir choice of a relatively unknown Daniel Craig to fill the shoes of a reimagined James Bond was met with howls of protest, if not derision. Craig’s too short! Too blond! Just no!\n\nBut Barbara Broccoli, daughter of Bond film guru Cubby, was no doubt spooked by a box office juggernaut starring Matt Damon. I am referring of course to the Jason Bourne franchise (another JB!). Bourne at the time was box office gold and appeared to be, according to a few critics, more Bond than Bond.\n\nSo, Craig’s first outing as Agent 007 was a triumph of grittier style, smarter visuals and a back story that even Bond creator Ian Fleming never had imagined: a wounded warrior, a psychologically damaged assassin and, as the indomitable M pointed out, an orphan. No family, no emotional attachments—the perfect spy with absolutely no baggage.\n\nThrough four pictures of varying quality, Craig nonetheless matured before our eyes into the iconic Bond. For my money, he was the best, even though as a young moviegoer I had considered Sean Connery untouchable in the role.\n\nAnd now, with “No Time to Die, we have the grand finale. For the longest time, a fifth Bond adventure had been considered a long shot, since Craig himself told anyone who’d listen he was done with the character. The fourth installment, “Spectre,” had taken a toll on him both physically and emotionally. And no amount of money, he said, would be enticing enough to have him return.\n\nBut somehow the producers found a way to change his mind. Clearly with an offer he couldn’t refuse: an island in the Caribbean? His own private jet? Whatever the enticement, we are richer for it.\n\n“No Time to Die” is a melancholy musing on what it means to be in service to Her Majesty at a time when Fleming’s hero is no longer playfully patting the butt of an unsuspecting woman or lighting up a cigarette onscreen. The old ways seem now creepy if not creaky.\n\nIn this final Bond film, 007 is so world-weary he’s abandoned the Crown and his calling and lives quietly in a tropical paradise with Madeleine Swann, his love interest introduced in “Spectre.”\n\nBut then, old friend and CIA stalwart Felix Lighter comes calling with an invitation to join him in one last adventure. Soon, Bond is in Cuba and chasing a Russian biochemist who has stolen a pathogen so lethal, it can kill with the slightest touch.\n\nBut there’s more to the sinister plot than we know at the outset. The Russian biochemist is a mere pawn in the employ of an evil puppet master played by Rami Malek (“Mr. Robot”).\n\nI don’t traffic in spoilers, so this is as far as I go. But it’s enough to say that Daniel Craig was more than satisfied with Bond’s swan song, as well as a plot detail he insisted upon when signing his first contract. Whether moviegoers will be equally satisfied is the bigger question.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/NO+TIME+TO+DIE+CRAIG+IN+BLUE.JPG",
      "date": "August 19, 2022",
      "datetime": "2022-8-19",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 1,
      "title": "Off The Rails",
      "movie": "Bullet Train",
      "slug": "/fort-kent-cinema-blog/review-of-bullet-train/",
      "body": "Agatha Christie was the master of the whodunit and to whom. One of her best-known works is “Murder on the Orient Express” and for good reason (check out the 1974 version directed by Sidney Lumet and starring Albert Finney and not the 2017 misfire directed by Kenneth Branagh). The identity of the killer is revealed slowly, like Christie is peeling the layers of an inscrutable onion.\n\nSo now we have “Bullet Train,” closer to “Snowpiercer” in terms of murder and unbridled mayhem than anything Christie could dream up, and that’s not all bad.\n\nBrad Pitt is the bleeding heart and soul of “Bullet Train,” a contract killer who’s been brought back from retirement and saddled by his handler with the unfortunate code name Ladybug. She says it’s because a ladybug is the symbol for luck. But in his line of work, he thinks that’s a stretch.\n\nHis assignment is to pinch-hit for a mercenary colleague named Mr. Carver, revealed much later as a Hollywood heavyweight but his identity isn’t too much of a surprise if you’ve been following the career of director David Leitch (“Deadpool 2”).\n\nLadybug is to recover a briefcase aboard the world’s fastest super train that’s en route to Kyoto from Tokyo. Find it and get off, he’s told. But easier said than done.\n\nBecause others are after that same briefcase and its contents, which eventually we learn is a boatload of cash and gold bullion.\n\nSoon, though, we find that the briefcase is in the hands of brothers with code names Lemon and Tangerine, played by Brian Tyree Henry and Aaron Taylor-Johnson. Given that Lemon is Black and Tangerine is white, the brother thing is just one more joke among many here.\n\nThey are also guarding the son of a Russian super villain with the spine-chilling sobriquet White Death. And they are under orders to deliver both the son and the loot or suffer the consequences. Super villains  can be downright ornery when their orders aren’t followed and White Death is notoriously vengeful.\n\nBut Ladybug gets lucky and finds the briefcase and even uses it to fight off an assassin named Wolf, whose wedding reception Pitt’s character is shown to have disrupted in a telling flashback. Or did he?\n\nYes, there are so many villains aboard the train, you almost need a scorecard. But director Leitch finds a clever way to keep it all straight.\n\nIn a bucket hat and black-rimmed glasses, Pitt exudes a chill A-list charm, tossing out asides like small hand grenades and demonstrating he’s every bit an action hero, even at this stage of his career. And crucial to the story is that Ladybug refuses to carry a gun, so he resorts to dispatchings that a MacGyver might envy.\n\nBut make no mistake. This is a gorefest that more than earns its R rating, with impalings, beheadings and any number of unfortunate events. Some even touching and sad. And perhaps one of the reasons that “Bullet Train” is so watchable is that gunplay often takes a back seat to swordplay, an obvious nod to the samurai culture that colors Japan’s early history.\n\nPitt is helped along with occasional cameos by some A-list friends, one of which had me laughing out loud. Their contributions, though, seem appropriate for an action flick in which bodies pile up like cord wood but that doesn’t take itself too seriously.\n\nIf you have a yen for excitement, this is just the ticket.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/BULLET+TRAIN+BRAD+PITT.JPG",
      "date": "August 19, 2022",
      "datetime": "2022-8-19",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 1,
      "title": "SONG OF THE SOUTH",
      "movie": "Where the Crawdads Sing",
      "slug": "/fort-kent-cinema-blog/review-of-where-the-crawdads-sing/",
      "body": "I have been mostly successful as a moviegoer to avoid reading books that are then turned into movies. And I can say the same about the best-seller “I Know Where the Crawdads Sing.” Having heard it’s a murder mystery, I didn’t want to go into the theater with full knowledge of the outcome, so I avoided the book altogether and any discussions about the plot.\n\nThe story of the title takes place in the 1950s and 1960s, in the deeply-held marshes of North Carolina, heavy with Spanish moss dripping from every tree limb and gators patrolling the murky waters like lethal submarines.\n\nEarly on we meet young Kya and her dysfunctional family, headed by an abusive drunk of a father played with appropriate menace by Garret Dillahunt. He’s not just a wife beater; he’ll strike out at anything on two legs and that forces Kya’s mother and siblings to run. Little Kya, though, remains and learns to harvest mussels at the shore to provide for herself and her father until he, too, abandons the girl.\n\nSo, Kya learns to fend for herself, with the generous looking-after from the colored couple who run the local general store. In time, Kya shows real promise as a naturalist and artist, twin pursuits that occupy her days but that earn her the nickname of “Marsh Girl.”\n\nEven as a grown woman, played by Daisy Edgar-Jones, she has a feral quality that keeps others at arm’s length. But then she meets Tate, who treats her gently and with an understanding that might seem a bit progressive for the time.\n\nTheir relationship is, for the most part, chaste in the way we have come to expect from Hallmark movies. And it appears they will become a couple. Though Tate is soon off to college with a solemn promise to return, a return we know is likely not in the cards. After all, how do you keep them down in the swamp after they’ve seen Chapel Hill?\n\n“Crawdads” is also a murder mystery, with the victim a rich, playboy-type named Chase, who pursues Kya after her break-up with Tate. He’s found at the bottom of a fire tower and naturally the townspeople point at the Marsh Girl as the likely suspect.\n\nA retired attorney played by David Strathairn takes Kya’s case out of a sense of obligation because he had known her as the poor, barefoot child he often spotted wandering the streets alone in Barkley Cove.\n\nIn better times, Kya had given Chase a necklace made from a shell she had found at the beach. And he was never seen without it until the night his crumpled body was found in the mud at the foot of that tower.\n\nChase’s mother accuses Kya in court of having ripped the necklace from her dead son’s neck. Because, well, who else could have done that?\n\nSo many questions and we get nothing but silence from Edgar-Jones. Yet her dark eyes speak volumes and maybe that’s all to the good.\n\nStrathairn is fine as the patient and almost paternalistic attorney. His low-key demeanor reminded me of Gregory Peck as Atticus Finch in “To Kill a Mockingbird.” But it’s Edgar-Jones who deserves the accolades for her turn as a riveting force of nature.\n\nCrawdads don’t sing, but she does. Hers is a tune made of marsh grass and fireflies and the soaring silhouettes of cranes.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/CRAWDADS+KYA+DRAWING.JPG",
      "date": "August 1, 2022",
      "datetime": "2022-8-1",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 1,
      "title": "FAIRY TALES DO COME TRUE",
      "movie": "Mrs. Harris Goes to Paris",
      "slug": "/fort-kent-cinema-blog/review-of-mrs-harris-goes-to-paris/",
      "body": "“Mrs. Harris” is a movie for anyone with a dream or who has been in love or who has dreamed of being in love.  In short, a movie for most of us.\n\nThis is the kind of picture that critics often say we need more of--a simple story without apology that doesn’t factor into the Marvel Comics Universe, and thank God for that.\n\nAda Harris is a hard-working cleaning lady who serves a variety of clients, most of whom have never had to lift a finger, not one day, in their posh London lives.\n\nOne in particular, a woman of means who somehow manages to skate by week after week without paying poor Ada, has just returned from a trip to Paris with the ultimate souvenir: a Christian Dior gown of such exquisite beauty it leaves Ada transfixed, if not envious.\n\nAnd a bit bewildered because the gown cost 500 pounds.\n\n“Five hundred quid for a dress?” she exclaims in amazement.\n\nAnd that sets her off on a quest to scrape up what she needs for the dress of her dreams, and it has to be a Dior.\n\nSome of the movie’s best scenes involve the inventive ways Mrs. Harris obtains enough cash for a ticket to the premier haunt of haute couture. Of course, we know from the title that she ends up in Paris, but the Gallic adventure has to wait while we take a tour of the life of a downtrodden domestic, one with colorful friends, including a chum played by Jason Isaacs who frequents the same pub down the street and who fancies her as his date to the upcoming Legion Dance.\n\nHarris, it’s important to know, was once married to Eddie, who went off to war and who, some twelve years later, still hasn’t been heard from. The story hints at Ada’s realization that something terrible happened, but she doesn’t want to admit to losing the love of her life and, worse, forever being known as a war widow.\n\nSo, she leans on her friend Vi, another cleaning lady with the keys to people’s houses and a fair knowledge of all their secrets.\n\nVi also knows Ada to be so headstrong that there’s no doubt at all her friend will end up wearing the ultimate in French fashion, even if she has nowhere to show off such a creation.\n\nThe year is 1957, which means The House of Dior is celebrating its tenth anniversary with the unveiling of a collection befitting that milestone.\n\nMrs. Harris manages to gain entrance to the couturier’s salon and atelier as can only really happen in a movie. But that’s beside the point.\n\nShe butts heads with Dior’s primary gatekeeper and creative director, an acid-tongued woman played by French icon Isabelle Huppert. And there’s no question that Britannia will rule whenever the two square off.\n\nBut there’s still the issue of this plain-spoken and plainly dressed woman in a universe in which she clearly doesn’t belong.\n\nDior, she’s told, serves only the wealthy when the label isn’t at the beck and call of royalty.\n\nBut we soon learn that that business model is unsustainable. In the 21st century, sure, Dior is practically a household name and in 2022 is celebrating its 75th year. But in 1957, the great man and fashion icon is close to shutting his doors.\n\nWhat he needs is an angel and it so happens angels come in all shapes, including one in sensible shoes and a thrift-store hat.\n\nBefore you can say “Blimey,” history is made, haute couture is saved and Mrs. Harris has more to show for her trip to Paris than memories of Montmarte.\n\nLesley Manville has made Ada Harris her own and is likely to earn a raft of award nominations, including a Bafta and an Oscar. She’s both tough and tender-hearted, as sweet as a rose but with a backbone that rivals the rigidity of Big Ben.\n\nAnd one more note: though the movie is a fiction, based on a best-selling novel, we know Christian Dior was a real person and one who was so synonymous with French fashion that the world knew him simply by his last name. Sadly, he died on vacation in Italy not long after he unveiled his tenth-anniversary collection.\n\nHis silhouettes, though, defied convention while also defining post-war fashion. The designs remain both impeccably clean and classic. \n\nStory-telling can be like that, too. Straightforward, with not a stitch out of place.\n\nMrs. Harris, back from Paris, would agree.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/MRS.+HARRIS+PINK+GOWN.JPG",
      "date": "August 1, 2022",
      "datetime": "2022-8-1",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    },
    {
      "id": 1,
      "title": "FAIRY TALES DO COME TRUE",
      "movie": "Mrs. Harris Goes to Paris",
      "slug": "/fort-kent-cinema-blog/review-of-mrs-harris-goes-to-paris/",
      "body": "“Mrs. Harris” is a movie for anyone with a dream or who has been in love or who has dreamed of being in love.  In short, a movie for most of us.\n\nThis is the kind of picture that critics often say we need more of--a simple story without apology that doesn’t factor into the Marvel Comics Universe, and thank God for that.\n\nAda Harris is a hard-working cleaning lady who serves a variety of clients, most of whom have never had to lift a finger, not one day, in their posh London lives.\n\nOne in particular, a woman of means who somehow manages to skate by week after week without paying poor Ada, has just returned from a trip to Paris with the ultimate souvenir: a Christian Dior gown of such exquisite beauty it leaves Ada transfixed, if not envious.\n\nAnd a bit bewildered because the gown cost 500 pounds.\n\n“Five hundred quid for a dress?” she exclaims in amazement.\n\nAnd that sets her off on a quest to scrape up what she needs for the dress of her dreams, and it has to be a Dior.\n\nSome of the movie’s best scenes involve the inventive ways Mrs. Harris obtains enough cash for a ticket to the premier haunt of haute couture. Of course, we know from the title that she ends up in Paris, but the Gallic adventure has to wait while we take a tour of the life of a downtrodden domestic, one with colorful friends, including a chum played by Jason Isaacs who frequents the same pub down the street and who fancies her as his date to the upcoming Legion Dance.\n\nHarris, it’s important to know, was once married to Eddie, who went off to war and who, some twelve years later, still hasn’t been heard from. The story hints at Ada’s realization that something terrible happened, but she doesn’t want to admit to losing the love of her life and, worse, forever being known as a war widow.\n\nSo, she leans on her friend Vi, another cleaning lady with the keys to people’s houses and a fair knowledge of all their secrets.\n\nVi also knows Ada to be so headstrong that there’s no doubt at all her friend will end up wearing the ultimate in French fashion, even if she has nowhere to show off such a creation.\n\nThe year is 1957, which means The House of Dior is celebrating its tenth anniversary with the unveiling of a collection befitting that milestone.\n\nMrs. Harris manages to gain entrance to the couturier’s salon and atelier as can only really happen in a movie. But that’s beside the point.\n\nShe butts heads with Dior’s primary gatekeeper and creative director, an acid-tongued woman played by French icon Isabelle Huppert. And there’s no question that Britannia will rule whenever the two square off.\n\nBut there’s still the issue of this plain-spoken and plainly dressed woman in a universe in which she clearly doesn’t belong.\n\nDior, she’s told, serves only the wealthy when the label isn’t at the beck and call of royalty.\n\nBut we soon learn that that business model is unsustainable. In the 21st century, sure, Dior is practically a household name and in 2022 is celebrating its 75th year. But in 1957, the great man and fashion icon is close to shutting his doors.\n\nWhat he needs is an angel and it so happens angels come in all shapes, including one in sensible shoes and a thrift-store hat.\n\nBefore you can say “Blimey,” history is made, haute couture is saved and Mrs. Harris has more to show for her trip to Paris than memories of Montmarte.\n\nLesley Manville has made Ada Harris her own and is likely to earn a raft of award nominations, including a Bafta and an Oscar. She’s both tough and tender-hearted, as sweet as a rose but with a backbone that rivals the rigidity of Big Ben.\n\nAnd one more note: though the movie is a fiction, based on a best-selling novel, we know Christian Dior was a real person and one who was so synonymous with French fashion that the world knew him simply by his last name. Sadly, he died on vacation in Italy not long after he unveiled his tenth-anniversary collection.\n\nHis silhouettes, though, defied convention while also defining post-war fashion. The designs remain both impeccably clean and classic. \n\nStory-telling can be like that, too. Straightforward, with not a stitch out of place.\n\nMrs. Harris, back from Paris, would agree.",
      "imageUrl": "https://cdn.fortkentcinema.com/review-photos/MRS.+HARRIS+PINK+GOWN.JPG",
      "date": "August 1, 2022",
      "datetime": "2022-8-1",
      "category": {
        "title": "Rick's Reviews",
        "slug": "#"
      },
      "author": {
        "name": "Rick Douglas",
        "role": "Movie Reviewer",
        "slug": "#",
        "imageUrl": "https://cdn.fortkentcinema.com/blog-authors/1516614597784.jpeg"
      }
    }
  ]
}